Revit 2027 API
ModelCurve.ChangeToReferenceLine Method
Changes this curve to a reference curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ChangeToReferenceLine()
Public Sub ChangeToReferenceLine
public:
void ChangeToReferenceLine()
member ChangeToReferenceLine : unit -> unit
See Also
Reference
ModelCurve Class
Autodesk.Revit.DB Namespace